<div class="page-header">
        <h1>Задание</h1>
</div>
	
<div class="well">
        <p><a href="https://docs.google.com/document/d/1fwJk2q7lNNmh5PEym_vkLWW0U-2GcNKmb-TCClCYJzE/edit" target="new">Исходный текст на docs.google.com</a></p>
        <p>Задача:</p>
<p>Реализовать​​ телефонный​​ справочник,​​ в​​ который​​ пользователь​​ может​​ заносить
фамилию,​​ имя,​​ отчество,​​ город,​​ улицу,​​ дату​​ рождения,​​ номер​​ телефона.​​ У
пользователя​​ должна​​ быть​​ возможность​​ добавлять,​​ редактировать​​ и​​ удалять​​ записи
из​​ справочника.​​ Город​​ и​​ улица​​ должны​​ выбираться​​ из​​ фиксированных​​ справочников,
которые​​ хранятся​​ в​​ базе​​ данных.​​​ Каждой​​ улице​​ соответствует​​ только​​ один​​ город.​​ При
выборе​​ города​​ в​​ форме​​ добавления​​ записи​​ в​​ телефонный​​ справочник,​​ список​​ улиц
должен​​ обновлять​​ с​​ помощью​​ JavaScript​​ таким​​ образом,​​ чтобы​​ пользователю​​ были
доступны​​ только​​ те​​ улицы,​​ которые​​ есть​​ в​​ выбранном​​ городе.</p>
<p>&nbsp;</p>
<p>Примечания​​ по​​ заданию:</p>
<p>1.​​ Желательно,​​ но​​ необязательно,​​ обновление​​ списка​​ улиц​​ при​​ выборе​​ города​​ должно
проходить​​ с​​ использованием​​ AJAX.</p>
<p>2.​​ Название​​ города,​​ улицы​​ пользователь​​ вводит​​ в​​ текстовое​​ поле​​ или​​ выбирает​​ из
списка​​ select.​​ Желательно,​​ в​​ первом​​ случае,​​ выдавать​​ ему​​ подсказки,​​ подходящие​​ под
введенный​​ текст.</p>
<p>&nbsp;</p>
<p>Общие​​ примечания:</p>
<p>1.​​ В​​ приложении​​ нужно​​ с​​ помощью​​ чистого​​ PHP​​ или​​ JavaScript​​ реализовать​​ модель
MVC​​ (фреймворки​​ использовать​​ нельзя).​​ Глупое​​ копирование​​ чужого​​ кода​​ замечается
сразу​​ и​​ пресекается​​ на​​ корню.​​ Пожалуйста,​​ комментируйте​​ код​​ подробнее.</p>
<p>2.​​ Мы​​ поощряем​​ любовь​​ к​​ конечному​​ пользователю​​ и​​ всевозможные​​ дополнения​​ к
заданию,​​ которые​​ приведут​​ к​​ более​​ легкой​​ работе​​ со​​ скриптом​​ со​​ стороны
пользователя.​​ Т.е.​​ любые​​ функциональные​​ находки​​ выделят​​ Вашу​​ работу​​ из​​ общей
массы​​ соискателей.</p>
<p>3.​​ Если​​ Вы​​ не​​ знаете​​ AJAX,​​ Вы​​ можете​​ выслать​​ вариант​​ задания​​ без​​ использования
AJAX​​ или​​ попытаться​​ быстро​​ изучить​​ необходимый​​ для​​ выполнения​​ задания
минимум.​​​ В​​ этом​​ случае,​​ пожалуйста,​​ честно​​ укажите​​ в​​ письме:​​ не​​ знаю​​ AJAX​​ или
работал​​ в​​ рамках​​ задания​​ с​​ AJAX​​ впервые,​​ чтобы​​ мы​​ могли​​ адекватно​​ оценивать
Ваши​​ способности​​ и​​ качество​​ кода.</p>
<p>4.​​ Также​​ оценивается​​ грамотно​​ использование​​ HTML-тегов,​​ с​​ точки​​ зрения
SEO-оптимизации.</p>
<p>5.​​ Если​​ у​​ Вас​​ есть​​ какие-либо​​ вопросы,​​ Вы​​ можете​​ задавать​​ их​​ по​​ почте.​​ Вопросы
приветствуются​​ –​​ если​​ что-то​​ не​​ понятно,​​ лучше​​ сразу​​ спросить,​​ чтобы​​ в​​ будущем​​ не
делать​​ лишней​​ работы.</p>
<p>&nbsp;</p>
<p>Что​​ мы​​ должны​​ от​​ Вас​​ получить:</p>
<p>1.​​ Приложение​​ нужно​​ развернуть​​ на​​ любом​​ бесплатном​​ хостинге,​​ чтобы​​ можно​​ было
посмотреть​​ его​​ в​​ действии.</p>
<p>2.​​ Исходный​​ код​​ разместите​​ на​​ GitHub.</p>
<p>3.​​ В​​ файле​​ README.md​​ должно​​ быть​​ кратким​​ описанием​​ работы​​ в​​ свободной​​ форме
        </p>
</div>
	
	
